Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/4.4.149/edc/ATSAML11D15A.PIC
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR4" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR5" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR6" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR7" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E41C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR8" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR9" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E424">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR10" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E428">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR11" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E42C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8D0" edc:_addr="0xE002E430"/>
      <edc:SFRDef ltx:memberofperipheral="SCB_NS" edc:cname="CPUID" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE002ED00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB_NS">
            <edc:SFRFieldDef edc:cname="Revision" edc:nzwidth="0x4" edc:desc="Revision number"/>
            <edc:SFRFieldDef edc:cname="PartNo" edc:nzwidth="0xC" edc:desc="Part number, 0xD20=Cortex-M23"/>
            <edc:SFRFieldDef edc:cname="Architecture" edc:nzwidth="0x4" edc:desc="Architecture version, 0xC=ARMv8-M Base Line, 0xF=ARMv8-M Main Line"/>
            <edc:SFRFieldDef edc:cname="Variant" edc:nzwidth="0x4" edc:desc="Variant number"/>
            <edc:SFRFieldDef edc:cname="Implementer" edc:nzwidth="0x8" edc:desc="Implementer code, ARM=0x41"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
