Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/4.4.149/edc/ATSAML11D15A.PIC
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x40000220"/>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="STATUSA" edc:nzwidth="0x20" edc:access="------------------rrrrrrrrrrrrrr" edc:por="00000000000000001100000000000000" edc:mclr="00000000000000001100000000000000" edc:impl="0x3FFF" edc:_addr="0x40000234">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:nzwidth="0x1" edc:desc="PAC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:nzwidth="0x1" edc:desc="PM APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:nzwidth="0x1" edc:desc="MCLK APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:nzwidth="0x1" edc:desc="RSTC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:nzwidth="0x1" edc:desc="OSCCTRL APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:nzwidth="0x1" edc:desc="OSC32KCTRL APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:nzwidth="0x1" edc:desc="SUPC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:nzwidth="0x1" edc:desc="GCLK APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:nzwidth="0x1" edc:desc="WDT APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:nzwidth="0x1" edc:desc="RTC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:nzwidth="0x1" edc:desc="EIC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:nzwidth="0x1" edc:desc="FREQM APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:nzwidth="0x1" edc:desc="PORT APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:nzwidth="0x1" edc:desc="AC APB Protect Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="STATUSB" edc:nzwidth="0x20" edc:access="----------------------------rrrr" edc:por="00000000000000000000000000000010" edc:mclr="00000000000000000000000000000010" edc:impl="0xF" edc:_addr="0x40000238">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="IDAU_" edc:nzwidth="0x1" edc:desc="IDAU APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:nzwidth="0x1" edc:desc="DSU APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:nzwidth="0x1" edc:desc="NVMCTRL APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:nzwidth="0x1" edc:desc="DMAC APB Protect Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="STATUSC" edc:nzwidth="0x20" edc:access="------------------rrrrrrrrrr-rrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF7" edc:_addr="0x4000023C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:nzwidth="0x1" edc:desc="EVSYS APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:nzwidth="0x1" edc:desc="SERCOM0 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:nzwidth="0x1" edc:desc="SERCOM1 APB Protect Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:nzwidth="0x1" edc:desc="TC0 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:nzwidth="0x1" edc:desc="TC1 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:nzwidth="0x1" edc:desc="TC2 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="ADC_" edc:nzwidth="0x1" edc:desc="ADC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:nzwidth="0x1" edc:desc="DAC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:nzwidth="0x1" edc:desc="PTC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:nzwidth="0x1" edc:desc="TRNG APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:nzwidth="0x1" edc:desc="CCL APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="OPAMP_" edc:nzwidth="0x1" edc:desc="OPAMP APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TRAM_" edc:nzwidth="0x1" edc:desc="TRAM APB Protect Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x40000240"/>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="NONSECA" edc:nzwidth="0x20" edc:access="------------------rrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFF" edc:_addr="0x40000254">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:nzwidth="0x1" edc:desc="PAC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:nzwidth="0x1" edc:desc="PM Non-Secure"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:nzwidth="0x1" edc:desc="MCLK Non-Secure"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:nzwidth="0x1" edc:desc="RSTC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:nzwidth="0x1" edc:desc="OSCCTRL Non-Secure"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:nzwidth="0x1" edc:desc="OSC32KCTRL Non-Secure"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:nzwidth="0x1" edc:desc="SUPC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:nzwidth="0x1" edc:desc="GCLK Non-Secure"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:nzwidth="0x1" edc:desc="WDT Non-Secure"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:nzwidth="0x1" edc:desc="RTC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:nzwidth="0x1" edc:desc="EIC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:nzwidth="0x1" edc:desc="FREQM Non-Secure"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:nzwidth="0x1" edc:desc="PORT Non-Secure"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:nzwidth="0x1" edc:desc="AC Non-Secure"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="NONSECB" edc:nzwidth="0x20" edc:access="----------------------------rrrr" edc:por="00000000000000000000000000000010" edc:mclr="00000000000000000000000000000010" edc:impl="0xF" edc:_addr="0x40000258">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="IDAU_" edc:nzwidth="0x1" edc:desc="IDAU Non-Secure"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:nzwidth="0x1" edc:desc="DSU Non-Secure"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:nzwidth="0x1" edc:desc="NVMCTRL Non-Secure"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:nzwidth="0x1" edc:desc="DMAC Non-Secure"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="NONSECC" edc:nzwidth="0x20" edc:access="------------------rrrrrrrrrr-rrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF7" edc:_addr="0x4000025C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:nzwidth="0x1" edc:desc="EVSYS Non-Secure"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:nzwidth="0x1" edc:desc="SERCOM0 Non-Secure"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:nzwidth="0x1" edc:desc="SERCOM1 Non-Secure"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:nzwidth="0x1" edc:desc="TC0 Non-Secure"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:nzwidth="0x1" edc:desc="TC1 Non-Secure"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:nzwidth="0x1" edc:desc="TC2 Non-Secure"/>
            <edc:SFRFieldDef edc:cname="ADC_" edc:nzwidth="0x1" edc:desc="ADC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:nzwidth="0x1" edc:desc="DAC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:nzwidth="0x1" edc:desc="PTC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:nzwidth="0x1" edc:desc="TRNG Non-Secure"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:nzwidth="0x1" edc:desc="CCL Non-Secure"/>
            <edc:SFRFieldDef edc:cname="OPAMP_" edc:nzwidth="0x1" edc:desc="OPAMP Non-Secure"/>
            <edc:SFRFieldDef edc:cname="TRAM_" edc:nzwidth="0x1" edc:desc="TRAM Non-Secure"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1A1" edc:_addr="0x40000260"/>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="SLEEPCFG" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000010" edc:mclr="00000010" edc:impl="0x7" edc:_addr="0x40000401">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="SLEEPMODE" edc:nzwidth="0x3" edc:desc="Sleep Mode">
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="CPU, AHB, APB clocks are OFF" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="STANDBY" edc:desc="All Clocks are OFF" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="All power domains are powered OFF" edc:when="(field &amp; 0x7) == 6"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="PLCFG" edc:nzwidth="0x8" edc:access="n-----nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x83" edc:_addr="0x40000402">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PLSEL" edc:nzwidth="0x2" edc:desc="Performance Level Select">
              <edc:SFRFieldSemantic edc:cname="PL0" edc:desc="Performance Level 0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PL2" edc:desc="Performance Level 2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PLDIS" edc:nzwidth="0x1" edc:desc="Performance Level Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PM" edc:cname="PWCFG" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40000403">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="RAMPSWC" edc:nzwidth="0x2" edc:desc="RAM Power Switch Configuration">
              <edc:SFRFieldSemantic edc:cname="16KB" edc:desc="16KB Available" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="12KB" edc:desc="12KB Available" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="8KB" edc:desc="8KB Available" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="4KB" edc:desc="4KB Available" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
